In [1]:
import pandas as pd
import numpy as np

# 1A

In [2]:
data_1 = {"State_Code": ['CA', 'TX', 'NY', 'FL'], "Name": ['California', 'Texas', 'New York', 'Florida']}

In [3]:
df1 = pd.DataFrame(data_1)

In [4]:
df1.head()

  State_Code        Name
0         CA  California
1         TX       Texas
2         NY    New York
3         FL     Florida

In [5]:
data_2 = {"State_Code": ['CA', 'CA', 'CA', 'TX', 'TX', 'NY', 'FL', 'FL'],
         "City_Name": ['Santa Barbara', 'Los Angeles', 'San Francisco', 'Austin', 'Dallas', 'New York', 'Miami', 'Orlando'],
         "Pop": [90000, 3900000, 90000, 950000, 1350000, 8400000, 450000, 300000]}

In [6]:
df2 = pd.DataFrame(data_2)

In [7]:
df2.head(10)

  State_Code      City_Name      Pop
0         CA  Santa Barbara    90000
1         CA    Los Angeles  3900000
2         CA  San Francisco    90000
3         TX         Austin   950000
4         TX         Dallas  1350000
5         NY       New York  8400000
6         FL          Miami   450000
7         FL        Orlando   300000

In [8]:
df3 = pd.merge(df1, df2, on="State_Code")

In [9]:
df3.head(10)

  State_Code        Name      City_Name      Pop
0         CA  California  Santa Barbara    90000
1         CA  California    Los Angeles  3900000
2         CA  California  San Francisco    90000
3         TX       Texas         Austin   950000
4         TX       Texas         Dallas  1350000
5         NY    New York       New York  8400000
6         FL     Florida          Miami   450000
7         FL     Florida        Orlando   300000

In [10]:
df3.loc[df3['State_Code'] == 'CA', 'Pop'].sum()

4080000

In [11]:
df3.loc[df3['State_Code'] == 'TX', 'Pop'].sum()

2300000

In [12]:
df3.loc[df3['State_Code'] == 'NY', 'Pop'].sum()

8400000

In [13]:
df3.loc[df3['State_Code'] == 'FL', 'Pop'].sum()

750000

In [14]:
data_3 = {"State_Code": ['CA', 'TX', 'NY', 'FL'], "Pop": ['4080000', '2300000', '8400000', '750000']}

In [15]:
df4 = pd.DataFrame(data_3)

In [16]:
df4.head()

  State_Code      Pop
0         CA  4080000
1         TX  2300000
2         NY  8400000
3         FL   750000

In [17]:
df3.head(10)

  State_Code        Name      City_Name      Pop
0         CA  California  Santa Barbara    90000
1         CA  California    Los Angeles  3900000
2         CA  California  San Francisco    90000
3         TX       Texas         Austin   950000
4         TX       Texas         Dallas  1350000
5         NY    New York       New York  8400000
6         FL     Florida          Miami   450000
7         FL     Florida        Orlando   300000

# 1B

In [18]:
df3.loc[df3['State_Code'] == 'CA', 'Pop'].max()

3900000

In [19]:
df3.loc[df3['State_Code'] == 'TX', 'Pop'].max()

1350000

In [20]:
df3.loc[df3['State_Code'] == 'NY', 'Pop'].max()

8400000

In [21]:
df3.loc[df3['State_Code'] == 'FL', 'Pop'].max()

450000

In [22]:
data_5 = {"State_Code": ['CA', 'TX', 'NY', 'FL'], "Pop": ['3900000', '1350000', '8400000', '450000']}

In [23]:
df5 = pd.DataFrame(data_5)

In [24]:
df5.head()

  State_Code      Pop
0         CA  3900000
1         TX  1350000
2         NY  8400000
3         FL   450000

# 1C

In [25]:
print(df3.var())

Pop    8.379441e+12
dtype: float64

In [26]:
print(df3.var()['Pop'])

8379441071428.571

# 1D

In [29]:
df3.loc[df3['State_Code'] == 'CA'].sort_values(by='Pop', ascending = False)

  State_Code        Name      City_Name      Pop
1         CA  California    Los Angeles  3900000
0         CA  California  Santa Barbara    90000
2         CA  California  San Francisco    90000

In [30]:
df3.loc[df3['State_Code'] == 'TX'].sort_values(by='Pop', ascending = False)

  State_Code   Name City_Name      Pop
4         TX  Texas    Dallas  1350000
3         TX  Texas    Austin   950000

In [31]:
df3.loc[df3['State_Code'] == 'NY'].sort_values(by='Pop', ascending = False)

  State_Code      Name City_Name      Pop
5         NY  New York  New York  8400000

In [32]:
df3.loc[df3['State_Code'] == 'FL'].sort_values(by='Pop', ascending = False)

  State_Code     Name City_Name     Pop
6         FL  Florida     Miami  450000
7         FL  Florida   Orlando  300000